# Parameter Property (Definition) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyManager..::..Parameter Property (Definition)
FamilyManager Class See Also
---
Obtains the parameter of this type with a given definition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FamilyParameter this[
	Definition definition
] { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Parameter ( _
	definition As Definition _
) As FamilyParameter
	Get
```

Visual C++
---
```text
public:
property FamilyParameter^ Parameter[Definition^ definition] {
	FamilyParameter^ get (Definition^ definition);
}
```

# ### Parameters
definition
    Type: Autodesk.Revit.DB..::..Definition
# Remarks
Returns nullNothingnullptra null reference (Nothing in Visual Basic) if the parameter is not found.
# See Also
FamilyManager Class
Parameter Overload
Autodesk.Revit.DB Namespace